In [16]:
import numpy as np
import pandas as pd

In [3]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                   'B': ['B0', 'B1', 'B2', 'B3'],
                   'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                    index = [0, 1, 2, 3]
                   )

In [4]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                   'B': ['B4', 'B5', 'B6', 'B7'],
                   'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                    index = [4, 5, 6, 7]
                   )

In [5]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                   'B': ['B8', 'B9', 'B10', 'B11'],
                   'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                    index = [8, 9, 10, 11]
                   )

In [6]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [9]:
df4 = pd.concat([df1,df2,df3], axis = 1)

In [26]:
df4.fillna(value = 1)

     A   B   C   D   A   B   C   D    A    B    C    D
0   A0  B0  C0  D0   1   1   1   1    1    1    1    1
1   A1  B1  C1  D1   1   1   1   1    1    1    1    1
2   A2  B2  C2  D2   1   1   1   1    1    1    1    1
3   A3  B3  C3  D3   1   1   1   1    1    1    1    1
4    1   1   1   1  A4  B4  C4  D4    1    1    1    1
5    1   1   1   1  A5  B5  C5  D5    1    1    1    1
6    1   1   1   1  A6  B6  C6  D6    1    1    1    1
7    1   1   1   1  A7  B7  C7  D7    1    1    1    1
8    1   1   1   1   1   1   1   1   A8   B8   C8   D8
9    1   1   1   1   1   1   1   1   A9   B9   C9   D9
10   1   1   1   1   1   1   1   1  A10  B10  C10  D10
11   1   1   1   1   1   1   1   1  A11  B11  C11  D11

In [27]:
df4

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [44]:
left = pd.DataFrame({ 'Key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']
                      }
                   )

In [45]:
right = pd.DataFrame({ 'Key': ['K0', 'K1', 'K2', 'K3'],
                     'C': ['C0', 'C1', 'C2', 'C3'],
                     'D': ['D0', 'D1', 'D2', 'D3']
                      }
                   )

In [46]:
left

  Key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [47]:
right

  Key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [48]:
# the merge function allws you to merge DataFrame together using a similar logic as merging SQL Tables together.

In [50]:
pd.merge(left,right,how ='inner', on = 'Key')

  Key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [52]:
left = pd.DataFrame({ 'Key1': ['K0', 'K0', 'K1', 'K3'],
                     'Key2': ['K0', 'K1', 'K0', 'K1'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']
                      }
                   )

In [53]:
right = pd.DataFrame({ 'Key1': ['K0', 'K1', 'K1', 'K2'],
                      'Key2': ['K0', 'K0', 'K0', 'K0'],
                     'C': ['C0', 'C1', 'C2', 'C3'],
                     'D': ['D0', 'D1', 'D2', 'D3']
                      }
                   )

In [54]:
left

  Key1 Key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K3   K1  A3  B3

In [55]:
right

  Key1 Key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [56]:
pd.merge(left, right, on = ['Key1', 'Key2'])

  Key1 Key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [57]:
pd.merge(left, right, how ='outer', on = ['Key1', 'Key2'])

  Key1 Key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K3   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [58]:
pd.merge(left,right, how = 'right', on = ['Key1', 'Key2'])

  Key1 Key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [60]:
pd.merge(left,right, how = 'left', on = ['Key1', 'Key2'])

  Key1 Key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K3   K1  A3  B3  NaN  NaN

In [61]:
# joining

In [62]:
  # joining is a convenient method for combining the columns of potentially differently -indexed DataFrames
    # into a single result DataFrame

In [74]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                   'B': ['B0','B1', 'B2']},
                   index = ['K0', 'K1','K2'])
right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                   'D': ['D0','D2', 'D3']},
                   index = ['K0', 'K2','K3'])

In [78]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [77]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [79]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [80]:
right.join(left)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [81]:
left.join(right, how ='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [82]:
# for DataFrame we need pandas package

In [83]:
import numpy as np

In [84]:
import pandas as pd

In [85]:
df = pd.DataFrame({'col1': [1, 2, 3, 4],
                  'col2': [444, 555, 666, 444],
                  'col3': ['abc', 'def', 'ghi', 'xyz']})

In [86]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [87]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [88]:
df['col2'].unique()

array([444, 555, 666])

In [90]:
len(df['col2'].unique())

3

In [91]:
df['col2'].nunique()

3

In [93]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [94]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [95]:
df[ (df['col1'] > 2) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

In [96]:
def times2(x):
    return x*2

In [97]:
df['col1'].sum()

10

In [98]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [99]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [100]:
df['col1'].apply(lambda x: x*3)

0     3
1     6
2     9
3    12
Name: col1, dtype: int64

In [102]:
df.drop('col1',axis = 1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [103]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [104]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [105]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [106]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [107]:
# sort

In [108]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [109]:
def square(num):
    return num**2

In [110]:
my_nums = [1, 2, 3, 4, 5]

In [111]:
for item in map(square,my_nums):
    print(item)

1
4
9
16
25

In [112]:
list(map(square,my_nums))

[1, 4, 9, 16, 25]

In [117]:
def splicer(mystring):
    if len(mystring)%2 == 0:
        return 'Even'
    else:
        return mystring[0]

In [118]:
names = ['Andy', 'Eve', 'Sally']

In [119]:
list(map(splicer,names))

['Even', 'E', 'S']

In [120]:
def check_even(num):
    return num%2 == 0

In [121]:
mynums= [1,2,3,4,5,6]

In [122]:
# grab even number from the list

In [124]:
list(filter(check_even,mynums))

[2, 4, 6]

In [125]:
# or
for n in filter(check_even, mynums):
    print(n)

2
4
6

In [127]:
def square(num):
    result = num ** 2
    return result

In [128]:
square(2)

4

In [129]:
# change to lambda

In [132]:
square = lambda num: num ** 2

In [133]:
square(2)

4

In [135]:
list(map(lambda num: num ** 2, mynums))

[1, 4, 9, 16, 25, 36]

In [137]:
list(filter(lambda num: num % 2 == 0, mynums))

[2, 4, 6]

In [138]:
list( map(lambda name: name[0], names ))

['A', 'E', 'S']

In [139]:
list( map(lambda name: name[::-1], names ))

['ydnA', 'evE', 'yllaS']

In [140]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [141]:
data = {'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
        'B': ['one', 'one', 'two', 'two', 'one', 'one'],
        'C': ['x', 'y', 'x', 'y', 'x', 'y'],
        'D': [1, 3, 2, 5, 4, 1]}

In [142]:
df = pd.DataFrame(data)

In [143]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [145]:
df.pivot_table(values = 'D', index = ['A','B'], columns = ['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN